# Python Data Science
## 08: importar datos csv a python

Vamos a ver c√≥mo importar csv cuando:
* Punto 1: datos separados por coma
* Punto 2: datos separados por puntos y comas
* Punto 3: no hay nombres de columnas

# Punto 0:

In [4]:
# importar pandas
import pandas as pd

# Punto 1:

In [ ]:
# caso 1: datos separados por coma

In [6]:
pd.read_csv('archivos\datos_rrss_t1.csv')

      Nombre  Cantidad     ES_FBK  Anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010
3    YouTube      2000      FALSO  2005
4   LinkedIn       663      FALSO  2003
5   WhatsApp      1600  VERDADERO  2009

# Punto 2:

In [ ]:
# caso 2: datos separados por puntos y comas

In [7]:
pd.read_csv('archivos\datos_rrss_t2.csv', sep=';')

      Nombre  Cantidad     ES_FBK  Anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010

# Punto 3:

In [ ]:
# caso 3: no hay nombres de columnas

In [8]:
pd.read_csv('archivos\datos_rrss_t3.csv', header=None, names=['nombre','cantidad','es_FBK','anio'] )

      nombre  cantidad     es_FBK  anio
0   Facebook      2449  VERDADERO  2006
1    Twitter       339      FALSO  2006
2  Instagram      1000  VERDADERO  2010
3    YouTube      2000      FALSO  2005
4   LinkedIn       663      FALSO  2003
5   WhatsApp      1600  VERDADERO  2009

# NuncaParesDeAprender!